Bwooce/ardupilot/libraries/AP_HAL_ESP32/CANIface.cpp

#include "CANIface.h"

#if HAL_NUM_CAN_IFACES > 0

#include <AP_HAL/AP_HAL.h>
#include "driver/gpio.h"
#include "driver/twai.h"
#include "esp_debug_helpers.h"  // For esp_backtrace_print()

extern const AP_HAL::HAL& hal;

using namespace ESP32;

// Use consistent ESP32 debug system controlled by ESP32_DEBUG_LVL parameter
#include "ESP32_Debug.h"

// CAN logging macros using ESP32 debug system
#define CAN_DEBUG_ERROR(fmt, ...)   ESP_LOGE("CAN", fmt, ##__VA_ARGS__)
#define CAN_DEBUG_WARN(fmt, ...)    ESP_LOGW("CAN", fmt, ##__VA_ARGS__)  
#define CAN_DEBUG_INFO(fmt, ...)    ESP_LOGI("CAN", fmt, ##__VA_ARGS__)
#define CAN_DEBUG_VERBOSE(fmt, ...) ESP_LOGD("CAN", fmt, ##__VA_ARGS__)
#define CAN_DEBUG_DEBUG(fmt, ...)   ESP_LOGV("CAN", fmt, ##__VA_ARGS__)

// Legacy compatibility
#define CAN_DEBUG_PRINTF(fmt, ...) CAN_DEBUG_INFO(fmt, ##__VA_ARGS__)

CANIface::CANIface(uint8_t instance) :
    ESP32_CANBase(instance),
    initialized(false),
    current_bitrate(500000),
    tx_tracker_index(0)
{
    // Initialize tx_tracker array
    memset(tx_tracker, 0, sizeof(tx_tracker));
}

bool CANIface::init(const uint32_t bitrate, const OperatingMode mode)
{
    // Set ESP-IDF log level for CAN tag based on CAN_LOGLEVEL
#if CAN_LOGLEVEL >= 4
    esp_log_level_set("CAN", ESP_LOG_VERBOSE);
#elif CAN_LOGLEVEL >= 3  
    esp_log_level_set("CAN", ESP_LOG_INFO);
#elif CAN_LOGLEVEL >= 2
    esp_log_level_set("CAN", ESP_LOG_WARN);
#else
    esp_log_level_set("CAN", ESP_LOG_ERROR);
#endif
    
    CAN_DEBUG_INFO("CAN interface %d initialized - bitrate=%u", instance, (unsigned)bitrate);
    CAN_DEBUG_INFO("CAN debug test - you should see this message!");
    CAN_DEBUG_VERBOSE("CAN_LOGLEVEL=%d, ESP-IDF log level set appropriately", CAN_LOGLEVEL);
    
    if (initialized) {
        CAN_DEBUG_INFO("CAN interface %d already initialized", instance);
        return true;
    }
    
    current_bitrate = bitrate;

    gpio_num_t tx_pin, rx_pin;

    if (instance == 0) {
#if HAL_NUM_CAN_IFACES > 0
        tx_pin = (gpio_num_t)HAL_CAN1_TX_PIN;
        rx_pin = (gpio_num_t)HAL_CAN1_RX_PIN;
        CAN_DEBUG_INFO("Initializing CAN interface %d with TX pin %d, RX pin %d, bitrate %u", 
               instance, (int)tx_pin, (int)rx_pin, (unsigned)bitrate);
#else
        CAN_DEBUG_ERROR("HAL_NUM_CAN_IFACES is 0, CAN disabled");
        return false;
#endif
    } else {
        // Only support CAN interface 0 with native TWAI
        // CAN interface 1+ should use MCP2515 or other external controllers
        CAN_DEBUG_ERROR("Instance %d not supported (only instance 0 supported)", instance);
        return false;
    }

    twai_general_config_t g_config = TWAI_GENERAL_CONFIG_DEFAULT(tx_pin, rx_pin, TWAI_MODE_NORMAL);
    twai_timing_config_t t_config;
    switch (bitrate) {
    case 1000000:
        t_config = TWAI_TIMING_CONFIG_1MBITS();
        break;
    case 500000:
        t_config = TWAI_TIMING_CONFIG_500KBITS();
        break;
    case 250000:
        t_config = TWAI_TIMING_CONFIG_250KBITS();
        break;
    case 125000:
        t_config = TWAI_TIMING_CONFIG_125KBITS();
        break;
    default:
        return false;
    }

    twai_filter_config_t f_config = TWAI_FILTER_CONFIG_ACCEPT_ALL();

    CAN_DEBUG_INFO("Installing TWAI driver...");
    esp_err_t install_result = twai_driver_install(&g_config, &t_config, &f_config);
    if (install_result != ESP_OK) {
        CAN_DEBUG_ERROR("TWAI driver install failed with error %d", install_result);
        return false;
    }
    CAN_DEBUG_INFO("TWAI driver installed successfully");

    CAN_DEBUG_INFO("Starting TWAI...");
    esp_err_t start_result = twai_start();
    if (start_result != ESP_OK) {
        CAN_DEBUG_ERROR("TWAI start failed with error %d", start_result);
        return false;
    }
    CAN_DEBUG_INFO("TWAI started successfully");

    CAN_DEBUG_INFO("Creating RX queue...");
    rx_queue = xQueueCreate(512, sizeof(CanRxItem));  // Increased from 128 to prevent drops
    if (rx_queue == NULL) {
        CAN_DEBUG_ERROR("Failed to create RX queue");
        return false;
    }

    CAN_DEBUG_INFO("Creating TX queue...");
    tx_queue = xQueueCreate(256, sizeof(CanTxItem));  // Also increased TX queue
    if (tx_queue == NULL) {
        CAN_DEBUG_ERROR("Failed to create TX queue");
        return false;
    }

    CAN_DEBUG_INFO("Creating RX and TX tasks...");
    xTaskCreate(rx_task, "can_rx", 4096, this, 5, NULL);
    // Higher priority for TX task to reduce latency in DNA responses
    xTaskCreate(tx_task, "can_tx", 4096, this, 6, NULL);

    initialized = true;
    CAN_DEBUG_INFO("Interface %d initialization complete!", instance);

    return true;
}

int16_t CANIface::send(const AP_HAL::CANFrame &frame, uint64_t tx_deadline, AP_HAL::CANIface::CanIOFlags flags)
{
    if (!initialized) {
        return -1;
    }


    CanTxItem tx_item;
    tx_item.frame = frame;
    tx_item.deadline_us = tx_deadline;
    tx_item.flags = flags;

    if (xQueueSendToBack(tx_queue, &tx_item, 0) != pdPASS) {
        return 0;
    }

    return 1;
}

int16_t CANIface::receive(AP_HAL::CANFrame &frame, uint64_t &timestamp_us, AP_HAL::CANIface::CanIOFlags &flags)
{
    if (!initialized) {
        return -1;
    }

    CanRxItem rx_item;
    if (xQueueReceive(rx_queue, &rx_item, 0) != pdPASS) {
        return 0;
    }

    frame = rx_item.frame;
    timestamp_us = rx_item.timestamp_us;
    flags = rx_item.flags;

    return 1;
}

bool CANIface::add_to_rx_queue(const CanRxItem &rx_item)
{
    return xQueueSendToBack(rx_queue, &rx_item, 0) == pdPASS;
}

void CANIface::rx_task(void *arg)
{
    CANIface *iface = (CANIface *)arg;
    CAN_DEBUG_INFO("CAN RX task started for interface %d", iface->instance);

    while (true) {
        twai_message_t message;
        esp_err_t rx_result = twai_receive(&message, portMAX_DELAY);
        
        if (rx_result != ESP_OK) {
            // Handle RX errors with enhanced detection
            if (rx_result == ESP_ERR_TIMEOUT) {
                // Normal timeout - no action needed
                continue;
            } else if (rx_result == ESP_FAIL) {
                // RX failure - check bus state
                twai_status_info_t twai_status;
                if (twai_get_status_info(&twai_status) == ESP_OK) {
                    if (twai_status.state == TWAI_STATE_BUS_OFF) {
                        CAN_DEBUG_ERROR("Bus-off detected during receive");
                        iface->update_error_stats(0x01); // Bus-off error
                    } else if (twai_status.state == TWAI_STATE_STOPPED) {
                        CAN_DEBUG_ERROR("TWAI stopped unexpectedly");
                        iface->update_error_stats(0x02); // Stopped error
                    }
                }
            } else {
                // Other RX errors
                iface->update_error_stats(rx_result);
            }
            continue;
        }

#if CAN_LOGLEVEL >= 4
        // Verbose frame-by-frame logging - use ESP-IDF VERBOSE level
        static uint32_t rx_count = 0;
        rx_count++;
        
        char data_str[32] = {0};
        for (int i = 0; i < message.data_length_code && i < 8; i++) {
            snprintf(data_str + (i * 3), sizeof(data_str) - (i * 3), "%02X ", message.data[i]);
        }
        
        CAN_DEBUG_VERBOSE("RX #%lu: ID=0x%08X DLC=%d DATA=[%s]", 
                         (unsigned long)rx_count, (unsigned)message.identifier, 
                         message.data_length_code, data_str);
#elif CAN_LOGLEVEL >= 3
        // INFO level - summary every 100 frames
        static uint32_t rx_count_summary = 0;
        rx_count_summary++;
        if ((rx_count_summary % 100) == 0) {
            CAN_DEBUG_INFO("Received %lu frames, latest ID=0x%08X", 
                           (unsigned long)rx_count_summary, (unsigned)message.identifier);
        }
#elif CAN_LOGLEVEL >= 2
        // WARN level - summary every 1000 frames (less verbose)
        static uint32_t rx_count_warn = 0;
        rx_count_warn++;
        if ((rx_count_warn % 1000) == 0) {
            CAN_DEBUG_WARN("CAN traffic detected: %lu frames received", (unsigned long)rx_count_warn);
        }
#endif

        CanRxItem rx_item;
        rx_item.timestamp_us = AP_HAL::micros64();
        rx_item.frame.id = message.identifier;
        if (message.extd) {
            rx_item.frame.id |= AP_HAL::CANFrame::FlagEFF;  // Set extended frame flag
        }
        rx_item.frame.dlc = message.data_length_code;
        memcpy(rx_item.frame.data, message.data, message.data_length_code);
        rx_item.flags = 0;
        
