Bwooce/ardupilot/libraries/AP_HAL_ESP32/CANIface.cpp
                        // Attempt bus recovery
                        twai_initiate_recovery();
                        // Note: Recovery is automatic in TWAI driver
                    }
                }
                // Reduce log spam - only log occasionally
                static uint32_t fail_count = 0;
                fail_count++;
                if (fail_count <= 5 || (fail_count % 100) == 0) {
                    CAN_DEBUG_ERROR("Failed to transmit message ID=0x%08X, error=%d (count=%lu)", 
                                    (unsigned)(tx_item.frame.id & AP_HAL::CANFrame::MaskExtID), 
                                    result, (unsigned long)fail_count);
                }
            } else if (result == ESP_ERR_INVALID_STATE) {
                // TWAI driver in invalid state - likely no other nodes on bus or disconnection
                // Only log periodically to avoid spam
                static uint32_t last_invalid_state_log_ms = 0;
                static uint32_t invalid_state_count = 0;
                uint32_t now_ms = AP_HAL::millis();
                invalid_state_count++;
                
                if (now_ms - last_invalid_state_log_ms > 10000) {  // Log at most every 10 seconds
                    CAN_DEBUG_ERROR("TWAI invalid state (no other nodes?) - count=%lu", (unsigned long)invalid_state_count);
                    last_invalid_state_log_ms = now_ms;
                    
                    // Only attempt restart if we've had persistent errors for a while
                    if (invalid_state_count > 100) {
                        iface->update_error_stats(0x08); // Invalid state error
                        iface->attempt_driver_restart();
                        invalid_state_count = 0;  // Reset counter after restart attempt
                    }
                }
            } else if (result == ESP_ERR_INVALID_ARG) {
                // Invalid argument - possibly corrupted message data
                // Rate limit this error to avoid spam
                static uint32_t last_invalid_arg_log_ms = 0;
                static uint32_t invalid_arg_count = 0;
                uint32_t now_ms = AP_HAL::millis();
                invalid_arg_count++;
                
                if (now_ms - last_invalid_arg_log_ms > 5000) {  // Log at most every 5 seconds
                    CAN_DEBUG_ERROR("TWAI invalid argument errors: %lu occurrences (last ID=0x%08X)", 
                                   (unsigned long)invalid_arg_count, (unsigned)tx_item.frame.id);
                    last_invalid_arg_log_ms = now_ms;
                    invalid_arg_count = 0;  // Reset counter
                }
                iface->update_error_stats(0x09); // Invalid argument error
            } else {
                // Other errors
                iface->update_error_stats(result);
                CAN_DEBUG_ERROR("Error %d on message ID=0x%08X", result, 
                                (unsigned)(tx_item.frame.id & AP_HAL::CANFrame::MaskExtID));
            }
        }
    }
}

// ESP32_CANBase pure virtual implementations
bool CANIface::configure_hw_filters(const CanFilterConfig* filter_configs, uint16_t num_configs)
{
    if (!initialized) {
        // Store filters for later application during init
        return true;
    }
    
    // ESP32 TWAI has single filter with acceptance code and mask
    // We need to calculate least-common-denominator filter for all requested filters
    uint32_t combined_acceptance = 0x00000000;
    uint32_t combined_mask = 0x00000000;  // Start permissive, will restrict based on filters
    
    if (num_configs > 0) {
        // Find the common mask bits across all filters
        uint32_t common_mask_bits = 0x1FFFFFFF;  // Start with all bits
        
        for (uint16_t i = 0; i < num_configs; i++) {
            const auto& filter = filter_configs[i];
            // Only keep mask bits that are common across ALL filters
            common_mask_bits &= filter.mask;
        }
        
        // Use the first filter's ID with the common mask
        if (num_configs == 1) {
            // Single filter - use exact match
            combined_acceptance = filter_configs[0].id & 0x1FFFFFFF;
            combined_mask = (~filter_configs[0].mask) & 0x1FFFFFFF;  // Invert for TWAI
        } else {
            // Multiple filters - use most permissive approach
            // Accept any message that matches at least one filter's pattern
            combined_acceptance = 0x00000000;  // Don't care about specific ID
            combined_mask = (~common_mask_bits) & 0x1FFFFFFF;  // Only filter on common bits
        }
        
        hal.console->printf("CAN%d: filters=%d, accept=0x%08lx, mask=0x%08lx\n",
                           instance, num_configs, 
                           (unsigned long)combined_acceptance, 
                           (unsigned long)combined_mask);
    } else {
        // No specific filters - accept all
        combined_acceptance = 0x00000000;
        combined_mask = 0x00000000;
        hal.console->printf("CAN%d: no filters - accepting all messages\n", instance);
    }
    
    // Apply the new filter configuration
    // Note: TWAI driver must be stopped before reconfiguring filters
    if (twai_stop() != ESP_OK) {
        CAN_DEBUG_ERROR("Failed to stop TWAI for filter reconfiguration");
        return false;
    }
    
    twai_filter_config_t new_filter;
    new_filter.acceptance_code = combined_acceptance;
    new_filter.acceptance_mask = combined_mask;
    new_filter.single_filter = true;  // Use single filter mode
    
    // Reconfigure the driver with new filter
    if (twai_driver_uninstall() != ESP_OK) {
        CAN_DEBUG_ERROR("Failed to uninstall TWAI driver for filter reconfiguration");
        return false;
    }
    
    // Reinstall with new filter
    gpio_num_t tx_pin = (gpio_num_t)HAL_CAN1_TX_PIN;
    gpio_num_t rx_pin = (gpio_num_t)HAL_CAN1_RX_PIN;
    
    twai_general_config_t g_config = TWAI_GENERAL_CONFIG_DEFAULT(tx_pin, rx_pin, TWAI_MODE_NORMAL);
    
    // ESP-IDF 5.5 configuration
    g_config.alerts_enabled = TWAI_ALERT_ALL;  // Enable all alerts
    g_config.clkout_divider = 0;  // No clock output
    g_config.tx_queue_len = 20;   // Increase TX queue
    g_config.intr_flags = ESP_INTR_FLAG_LEVEL1;  // Level 1 interrupt
    
    twai_timing_config_t t_config;
    
